docs/1c-export-2026-06-02/Reports/Прайс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Report>
		<Properties>
			<Name>Прайс</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СписокГруп</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

docs/1c-export-2026-06-02/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/Reports/Прайс/Ext/ObjectModule.bsl
Процедура ОпределитьДанные(ТабДок) Экспорт
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!
	
	Макет = Отчеты.Прайс.ПолучитьМакет("МакетПрайс");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Артикул КАК Артикул,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура.СреднийВес КАК СреднийВес,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура.СсылкаНаYouTube КАК НоменклатураСсылкаНаYouTube,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ПосиланняНаНаявніЛоти КАК НоменклатураПосиланняНаНаявніЛоти,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Родитель КАК НоменклатураРодитель,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Родитель.Родитель КАК НоменклатураРодительРодитель,
		|	ВЫБОР
		|		КОГДА ЦіниАкційні.Цена <> ЦеныНоменклатурыСрезПоследних.Цена
		|			ТОГДА ЦіниАкційні.Цена
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Акція,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Наименование КАК НоменклатураНаименование,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Родитель.Сортировка КАК НоменклатураРодительСортировка,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Родитель.Родитель.Сортировка КАК НоменклатураРодительРодительСортировка,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&ТекущаяДата,
		|			НЕ Номенклатура.ПометкаУдаления
		|				И Номенклатура В ИЕРАРХИИ (&СписокГруп)
		|				И ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				&ТекущаяДата,
		|				НЕ Номенклатура.ПометкаУдаления
		|					И Номенклатура В ИЕРАРХИИ (&СписокГруп)
		|					И ТипЦен = &ТипЦенАкційний) КАК ЦіниАкційні
		|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ЦіниАкційні.Номенклатура
		|			И ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры = ЦіниАкційні.ХарактеристикаНоменклатуры
		|
		|УПОРЯДОЧИТЬ ПО
		|	НоменклатураРодительРодительСортировка,
		|	НоменклатураРодительСортировка,
		|	НоменклатураНаименование
		|ИТОГИ ПО
		|	НоменклатураРодитель";
	Запрос.УстановитьПараметр("ТипЦен", Справочники.ТипыЦенНоменклатуры.ЦенаПродажиВес);
	Запрос.УстановитьПараметр("ТипЦенАкційний", Справочники.ТипыЦенНоменклатуры.ПродажБезАкций);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("СписокГруп", СписокГруп);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьНоменклатураРодитель = Макет.ПолучитьОбласть("НоменклатураРодитель");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
    ОбластьНоменклатураРодительРодитель = Макет.ПолучитьОбласть("НоменклатураРодительРодитель");
	ОбластьВложенаГрупа = Макет.ПолучитьОбласть("ВложенаГрупа");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаНоменклатураРодитель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	НомТЗ = РезультатЗапроса.Выгрузить();
	
	ТЗНоменклатураРодительРодитель = РезультатЗапроса.Выгрузить();
	ТЗНоменклатураРодительРодитель.Свернуть("НоменклатураРодительРодитель");
	
	//Для Каждого Строка ИЗ ТЗНоменклатураРодительРодитель Цикл 
	//	Если Не Строка.НоменклатураРодительРодитель.Уровень() = 0 Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Если ЗначениеЗаполнено(Строка.НоменклатураРодительРодитель)  Тогда
	//		ОбластьНоменклатураРодительРодитель.Параметры.НоменклатураРодительРодитель = Строка.НоменклатураРодительРодитель;
	//		ТабДок.Вывести(ОбластьНоменклатураРодительРодитель);
	//		ВыборкаДетальныеЗаписи = ВыборкаНоменклатураРодитель.Выбрать();
	//		
	//		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
	//			ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
	//		КонецЦикла;
	//	КонецЕсли;
	//	ВыборкаНоменклатураРодитель.Сбросить();
	//	Пока ВыборкаНоменклатураРодитель.Следующий() Цикл
	//		Если ВыборкаНоменклатураРодитель.НоменклатураРодитель = Строка.НоменклатураРодительРодитель Тогда
	//			ОбластьНоменклатураРодитель.Параметры.Заполнить(ВыборкаНоменклатураРодитель);
	//			ТабДок.Вывести(ОбластьНоменклатураРодитель, ВыборкаНоменклатураРодитель.Уровень());
	//			Продолжить;
	//		КонецЕсли;
	//		Если ВыборкаНоменклатураРодитель.НоменклатураРодительРодитель = Строка.НоменклатураРодительРодитель Тогда
	//			Если Не ЗначениеЗаполнено(Строка.НоменклатураРодительРодитель) Тогда
	//				ОбластьНоменклатураРодительРодитель.Параметры.НоменклатураРодительРодитель = ВыборкаНоменклатураРодитель.НоменклатураРодитель;
	//				ТабДок.Вывести(ОбластьНоменклатураРодительРодитель);	
	//			Иначе
	//				ОбластьНоменклатураРодитель.Параметры.Заполнить(ВыборкаНоменклатураРодитель);
	//				ТабДок.Вывести(ОбластьНоменклатураРодитель, ВыборкаНоменклатураРодитель.Уровень());
	//			КонецЕсли;
	//			
	//			ВыборкаДетальныеЗаписи = ВыборкаНоменклатураРодитель.Выбрать();
	//			
	//			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//				ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
	//				ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
	//			КонецЦикла;
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Група,
	|	Номенклатура.Родитель
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа
	|	И Номенклатура.Ссылка В ИЕРАРХИИ(&СписокГруп)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура.Сортировка";
	Запрос.УстановитьПараметр("СписокГруп", СписокГруп);
	ТЗГрупа = Запрос.Выполнить().Выгрузить();
	
	//Отбор = Новый Структура;
	//Отбор.Вставить("Родитель", 
	
	
	
	Для каждого Стр Из ТЗГрупа Цикл
		Если Стр.Група.Уровень() = 0 Тогда 
			ВыборкаНоменклатураРодитель.Сбросить();
			ОбластьНоменклатураРодительРодитель.Параметры.НоменклатураРодительРодитель = Стр.Група;
			ТабДок.Вывести(ОбластьНоменклатураРодительРодитель);
			
			
			Пока ВыборкаНоменклатураРодитель.Следующий() Цикл
				Если ВыборкаНоменклатураРодитель.НоменклатураРодительРодитель = Стр.Група Тогда
					
					
					ОбластьНоменклатураРодитель.Параметры.Заполнить(ВыборкаНоменклатураРодитель);
					ТабДок.Вывести(ОбластьНоменклатураРодитель, ВыборкаНоменклатураРодитель.Уровень());
					
					ВыборкаДетальныеЗаписи = ВыборкаНоменклатураРодитель.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
						ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
					КонецЦикла;
					Для Каждого Строка Из ТЗГрупа Цикл
						Если Строка.Група.Родитель = ВыборкаНоменклатураРодитель.НоменклатураРодитель Тогда
							ОбластьВложенаГрупа.Параметры.ВложенаГрупа = Строка.Група;
							ТабДок.Вывести(ОбластьВложенаГрупа);
			
							Отбор = Новый Структура;
							Отбор.Вставить("НоменклатураРодитель", Строка.Група);
							НомВГрупе = НомТЗ.НайтиСтроки(Отбор);
							Для Каждого Элемент Из НомВГрупе Цикл
								Если ЗначениеЗаполнено(Элемент.НоменклатураНаименование) Тогда
								ОбластьДетальныхЗаписей.Параметры.Заполнить(Элемент);
								ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЦикла;
				ИначеЕсли ВыборкаНоменклатураРодитель.НоменклатураРодитель = Стр.Група Тогда
					ВыборкаДетальныеЗаписи = ВыборкаНоменклатураРодитель.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
						ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
					КонецЦикла;
					Для Каждого Строка Из ТЗГрупа Цикл
						Если Строка.Група.Родитель = ВыборкаНоменклатураРодитель.НоменклатураРодитель Тогда
							ОбластьНоменклатураРодитель.Параметры.НоменклатураРодитель = Строка.Група;
							ТабДок.Вывести(ОбластьНоменклатураРодитель);
			
							Отбор = Новый Структура;
							Отбор.Вставить("НоменклатураРодитель", Строка.Група);
							НомВГрупе = НомТЗ.НайтиСтроки(Отбор);
							Для Каждого Элемент Из НомВГрупе Цикл
								Если ЗначениеЗаполнено(Элемент.НоменклатураНаименование) Тогда
								ОбластьДетальныхЗаписей.Параметры.Заполнить(Элемент);
								ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЦикла;/////
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА








КонецПроцедуры
